#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include "stack.h"
#define SIZE 20
extern int board[SIZE][SIZE];
extern stack path;
void StartNewGame();
void printTitle();
void draw();
void gaming(int color = 1);
void load(char *filename);
void welcome()
{
    //do something
    system("cls");
    printTitle();
    char op[255];
    //scanf("%s",op);
    gets(op);
    while (op[0] != 'q')
    {
        if (op[0] == 'n')
        {
            StartNewGame();
            gets(op);
        }
        else if (op[0] == 'l')
        {
            char t, filename[255];
            sscanf(op, "%c %s", &t, filename);
            memset(board, 0, sizeof(board));
            path.init();
            load(filename);
            int color = path.top().state;
            color = (color == 1) ? 2 : 1;
            draw();
            gaming(color);
        }
        else{
            printf("没有这个命令，请重新输入\n");
        }
        gets(op);
    }
    if(op[0]=='q') exit(1);
    //while(1) StartNewGame();
}

void printTitle()
{
    printf("欢迎界面命令说明（括号中为参数）：            ##########################################################################################\n");
    printf("n：开始新游戏                                 #################################################################################    #####\n");
    printf("l (filename)：从filename中加载未完成的棋局    ################################################################    ###     #####    #####\n");
    printf("q：退出                                       ##                        #######                      #########    ###     #####    #####\n");
    printf("                                              ##                        #######                      #########    ##                 ###\n");
    printf("游戏时命令说明（括号中为参数）：              ##                        #######                      #########    ##                 ###\n");
    printf("r (rank) (column)：在(rank,column)处落子      ##                        #######                      #######                         ###\n");
    printf("b：悔棋                                       #########     ################################         #######                         ###\n");
    printf("s (filename)：将棋局存在filename中            ########     ################################        #########        #     #####    #####\n");
    printf("l (filename)：从filename中加载未完成的棋局    ########     ##############################         ##########        #     #####    #####\n");
    printf("q：退出                                       ########     ##############################       #############     ###              #####\n");
    printf("m：回到主菜单                                 ##                     ####################      ##############      ##              #####\n");
    printf("h：查看命令帮助                               ##                     ####################    ################       #              #####\n");
    printf("                                              ##                     ########                          #####        #     #####    #####\n");
    printf("                                              ##                     ########                          #####                       #####\n");
    printf("                                              #######     #######    ########                          #####                       #####\n");
    printf("                                              #######     #######    ########                          ####         #              #####\n");
    printf("                                              #######     #######    ####################    ##############       ###     #####    #####\n");
    printf("                                              #######     #######    ####################    ##############       ###     #####    #####\n");
    printf("                                              ######     ########    ####################    ##############       #                  ###\n");
    printf("                                              ######     ########    ####################    ###############      #                  ###\n");
    printf("                                              ######     ########    ###################     ############### #    #                  ###\n");
    printf("                                              ######     ########    ###################     #################    #                  ###\n");
    printf("                                              #                          #########           #################    ##       ###      ####\n");
    printf("                                              #                          #########           #################             ###        ##\n");
    printf("                                              #                          #########           #################           ######       ##\n");
    printf("                                              #                          #########          ##################    #     #########    ###\n");
    printf("                                              ################################################################    #   ############  ####\n");
    printf("                                              ##########################################################################################\n");
}
